In [1]:
import pandas as pd
import numpy as np

In [4]:
labels = ['a','b','c']
my_data = [10,20,30]
dic = {'a':1,'b':2,'c':3}
my_list = np.array(my_data)

# Series

In [5]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(dic)

a    1
b    2
c    3
dtype: int64

In [8]:
#or
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int32

In [9]:
ser1 = pd.Series([1,2,3,4],['USA','India','UK','Germany'])
ser1

USA        1
India      2
UK         3
Germany    4
dtype: int64

In [10]:
ser2 = pd.Series([1,2,4,5],['India','USA','UK','China'])

In [11]:
ser2

India    1
USA      2
UK       4
China    5
dtype: int64

In [12]:
ser3 = ser1+ser2

In [13]:
ser3

China      NaN
Germany    NaN
India      3.0
UK         7.0
USA        3.0
dtype: float64

In [14]:
ser1['USA']

1

In [15]:
ser2['India']

1

In [17]:
ser3['Germany']=3.0

In [18]:
ser3

China      NaN
Germany    3.0
India      3.0
UK         7.0
USA        3.0
dtype: float64

# DataFrames

In [23]:
my_data = np.random.randint(0,100,25).reshape(5,5)

In [25]:
df = pd.DataFrame(my_data,['A','B','C','D','E'],['USA','India','UK','Germany','China'])

In [26]:
df

   USA  India  UK  Germany  China
A    1     92  91       78     37
B   30     12  31       64     33
C   20     77  82       95     14
D   73     43   9       30     84
E   50     55  85       61     34

In [27]:
df['USA']

A     1
B    30
C    20
D    73
E    50
Name: USA, dtype: int32

In [29]:
type(df['USA'])

pandas.core.series.Series

In [30]:
type(df)

pandas.core.frame.DataFrame

In [31]:
#i.e DataFrames are just combination of series.

In [32]:
df[['USA','India']]

   USA  India
A    1     92
B   30     12
C   20     77
D   73     43
E   50     55

In [37]:
#Want to add new column.

In [52]:
df['New'] = df['India']+df['Germany']

In [39]:
df

   USA  India  UK  Germany  China  New
A    1     92  91       78     37  170
B   30     12  31       64     33   76
C   20     77  82       95     14  172
D   73     43   9       30     84   73
E   50     55  85       61     34  116

In [40]:
df.shape

(5, 6)

In [53]:
#want to remove column..

In [55]:
df.drop('New',axis=1,inplace=True)#For columns and rows,axis=1 and 0 resp.
df

   USA  India  UK  Germany  China
A    1     92  91       78     37
B   30     12  31       64     33
C   20     77  82       95     14
D   73     43   9       30     84
E   50     55  85       61     34

In [56]:
#want to remove row

In [57]:
df.drop('E')

   USA  India  UK  Germany  China
A    1     92  91       78     37
B   30     12  31       64     33
C   20     77  82       95     14
D   73     43   9       30     84

In [58]:
df

   USA  India  UK  Germany  China
A    1     92  91       78     37
B   30     12  31       64     33
C   20     77  82       95     14
D   73     43   9       30     84
E   50     55  85       61     34

In [59]:
#Selecting rows..

In [60]:
df.loc['A']

USA         1
India      92
UK         91
Germany    78
China      37
Name: A, dtype: int32

In [62]:
df.loc[['A','C']]

   USA  India  UK  Germany  China
A    1     92  91       78     37
C   20     77  82       95     14

In [63]:
#Another method

In [64]:
df.iloc[1]

USA        30
India      12
UK         31
Germany    64
China      33
Name: B, dtype: int32

In [65]:
df.iloc[[0,2,3]]

   USA  India  UK  Germany  China
A    1     92  91       78     37
C   20     77  82       95     14
D   73     43   9       30     84

In [67]:
df.loc['A','India']

92

In [71]:
df.loc[['B','E'],['Germany','India']]

   Germany  India
B       64     12
E       61     55

In [72]:
#DataFrames on basis of boolean......

In [73]:
df>10

     USA  India     UK  Germany  China
A  False   True   True     True   True
B   True   True   True     True   True
C   True   True   True     True   True
D   True   True  False     True   True
E   True   True   True     True   True

In [74]:
df[df>10]

    USA  India    UK  Germany  China
A   NaN     92  91.0       78     37
B  30.0     12  31.0       64     33
C  20.0     77  82.0       95     14
D  73.0     43   NaN       30     84
E  50.0     55  85.0       61     34

In [75]:
#Better Way: 
df[df['USA']>10]

   USA  India  UK  Germany  China
B   30     12  31       64     33
C   20     77  82       95     14
D   73     43   9       30     84
E   50     55  85       61     34

In [78]:
df[df['India']>15]['China']

A    37
C    14
D    84
E    34
Name: China, dtype: int32

In [81]:
df

   USA  India  UK  Germany  China
A    1     92  91       78     37
B   30     12  31       64     33
C   20     77  82       95     14
D   73     43   9       30     84
E   50     55  85       61     34

In [87]:
#Applying Multiple Conditions:

df[(df['India']>15) & (df['USA']<30)]

   USA  India  UK  Germany  China
A    1     92  91       78     37
C   20     77  82       95     14

In [92]:
#using or 
df[(df['Germany']>100) | (df['UK']<50)] # it means all those statements where values in germany are greater than 100 or all values in UK under 50

   USA  India  UK  Germany  China
B   30     12  31       64     33
D   73     43   9       30     84

In [102]:
#Null values

my_dict = {'A':[0,2,np.nan],'B':[4,np.nan,6],'C':[5,np.nan,np.nan]}

df = pd.DataFrame(my_dict)

df

     A    B    C
0  0.0  4.0  5.0
1  2.0  NaN  NaN
2  NaN  6.0  NaN

In [103]:
df.dropna()

     A    B    C
0  0.0  4.0  5.0

In [104]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [113]:
df.dropna(thresh=2)

     A    B    C
0  0.0  4.0  5.0

In [114]:
#now filling the missing data:

df.fillna(value='Data')

      A     B     C
0     0     4     5
1     2  Data  Data
2  Data     6  Data

In [115]:
df.fillna(value=df['A'].mean())

     A    B    C
0  0.0  4.0  5.0
1  2.0  1.0  1.0
2  1.0  6.0  1.0